# DataFrames

DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object. Like Series, DataFrame accepts many different kinds of input:

* Dict of 1D ndarrays, lists, dicts, or Series
* 2-D numpy.ndarray
* Structured or record ndarray
* A Series
* Another DataFrame

Along with the data, you can optionally pass index (row labels) and columns (column labels) arguments. If you pass an index and / or columns, you are guaranteeing the index and / or columns of the resulting DataFrame. Thus, a dict of Series plus a specific index will discard all data not matching up to the passed index.

If axis labels are not passed, they will be constructed from the input data based on common sense rules.

In [1]:
import pandas as pd
import numpy as np

In [2]:
# This will generate the same random number everytime
np.random.seed(42)

In [3]:
df = pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(),columns='V W X Y'.split())
# Also we can write
# df = pd.DataFrame(np.random.randn(5,4), ['A', 'B', 'C', 'D', 'E'], ['V', W', 'X', 'Y'])

In [4]:
df

          V         W         X         Y
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288
E -1.012831  0.314247 -0.908024 -1.412304

In [5]:
type(df)

pandas.core.frame.DataFrame

## Selection and Indexing

In [6]:
df['X']

A    0.647689
B    1.579213
C   -0.463418
D   -1.724918
E   -0.908024
Name: X, dtype: float64

This can also be down in other way which is a lot similar to SQL.

In [7]:
df.X

A    0.647689
B    1.579213
C   -0.463418
D   -1.724918
E   -0.908024
Name: X, dtype: float64

Though the second way should not be used as some time a column name might overwrite defualt DataFrame methods available.

Which can be found by using:
**dir(pd.core.frame.DataFrame)**

In [8]:
# Here df['X'] is a series i.e. DataFrame Columns are just Series
type(df['X'])

pandas.core.series.Series

In [9]:
# Pass a list of column names
df[['W','Y']]

          W         Y
A -0.138264  1.523030
B -0.234137  0.767435
C  0.542560 -0.465730
D -1.913280 -0.562288
E  0.314247 -1.412304

### Creating a new column

In [10]:
df['Z'] = df['W'] + df['Y']

In [11]:
df

          V         W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030  1.384766
B -0.234153 -0.234137  1.579213  0.767435  0.533298
C -0.469474  0.542560 -0.463418 -0.465730  0.076830
D  0.241962 -1.913280 -1.724918 -0.562288 -2.475568
E -1.012831  0.314247 -0.908024 -1.412304 -1.098056

### Removing Columns

While droping column it should be note that we have to explicitly specify the axis in drop method.

* axis = 0 **=>** Row or Index
* axis = 1 **=>** Column

Other thing to note is that by default the inplace parameter in drop method is False, i.e. there will be no effect on the original dataframe. We have to specify **inplace=True** if we also want change to be take place in our original method.

In [12]:
df.drop('Z',axis=1)

          V         W         X         Y
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288
E -1.012831  0.314247 -0.908024 -1.412304

In [13]:
# By default inplace is False, check by pressing Shift+Tab after drop(
df

          V         W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030  1.384766
B -0.234153 -0.234137  1.579213  0.767435  0.533298
C -0.469474  0.542560 -0.463418 -0.465730  0.076830
D  0.241962 -1.913280 -1.724918 -0.562288 -2.475568
E -1.012831  0.314247 -0.908024 -1.412304 -1.098056

In [14]:
df.drop('Z',axis=1,inplace=True)

In [15]:
df

          V         W         X         Y
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288
E -1.012831  0.314247 -0.908024 -1.412304

We can also drop rows this way

In [16]:
df.drop('E')
# df.drop('E',axis=0)

          V         W         X         Y
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288

In [17]:
# Again it's not inplace by default
df

          V         W         X         Y
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288
E -1.012831  0.314247 -0.908024 -1.412304

Now back to why axis = 0 => Row or Index and axis = 1 => Column?

In [18]:
df.shape

(5, 4)

Here you can see that calling df.shape returns a tuple whose **0th index is number of rows** and **1st index is number of column**.

That's why axis = 0 **=>** Row or Index and axis = 1 **=>** Column.

### Selecting Rows

In [19]:
df.loc['A']

V    0.496714
W   -0.138264
X    0.647689
Y    1.523030
Name: A, dtype: float64

This can be also achieved by specifying the index number (row number) [starting with 0].

In [20]:
df.iloc[0]

V    0.496714
W   -0.138264
X    0.647689
Y    1.523030
Name: A, dtype: float64

Also note that not only column are series but rows are also series

In [21]:
type(df.loc['A'])

pandas.core.series.Series

## Selecting subset of rows and columns

In [22]:
df.loc['B','Y']

0.76743472915290878

In [23]:
df.loc[['A','C'],['V','Y']]

          V        Y
A  0.496714  1.52303
C -0.469474 -0.46573

### Conditional Selection

This is very similar to NumPy.

In [24]:
df

          V         W         X         Y
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288
E -1.012831  0.314247 -0.908024 -1.412304

In [25]:
booldf = df > 0

In [26]:
booldf

       V      W      X      Y
A   True  False   True   True
B  False  False   True   True
C  False   True  False  False
D   True  False  False  False
E  False   True  False  False

In [27]:
df[booldf]
# df[df > 0]

          V         W         X         Y
A  0.496714       NaN  0.647689  1.523030
B       NaN       NaN  1.579213  0.767435
C       NaN  0.542560       NaN       NaN
D  0.241962       NaN       NaN       NaN
E       NaN  0.314247       NaN       NaN

** Filter out rows based of column values **

In [28]:
df['W'] > 0

A    False
B    False
C     True
D    False
E     True
Name: W, dtype: bool

In [29]:
df[df['W'] > 0]

          V         W         X         Y
C -0.469474  0.542560 -0.463418 -0.465730
E -1.012831  0.314247 -0.908024 -1.412304

NOTE: This returns a dataframe

In [30]:
type(df[df['W'] > 0])

pandas.core.frame.DataFrame

Therefore we can use it as DataFrame

In [31]:
df[df['W']>0]['Y']

C   -0.465730
E   -1.412304
Name: Y, dtype: float64

In [32]:
df[df['W']>0][['Y','X']]

          Y         X
C -0.465730 -0.463418
E -1.412304 -0.908024

For two conditions you can use | and & with parenthesis:

In [33]:
df[(df['V']>0) & (df['Y'] > 1)]

          V         W         X        Y
A  0.496714 -0.138264  0.647689  1.52303

NOTE: We can't use **and** operator to compare two series i.e. **df['V'] > 0 and df['Y'] > 1** is **invalid**. **and** operator can only compare single boolean values like **True and False**.

Hence we have to use bitwise and operator.

## More Index Details

In [34]:
df

          V         W         X         Y
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288
E -1.012831  0.314247 -0.908024 -1.412304

### Reset index

In [35]:
# Reset to default 0,1...n index
# Also it is not Inplace
df.reset_index()

  index         V         W         X         Y
0     A  0.496714 -0.138264  0.647689  1.523030
1     B -0.234153 -0.234137  1.579213  0.767435
2     C -0.469474  0.542560 -0.463418 -0.465730
3     D  0.241962 -1.913280 -1.724918 -0.562288
4     E -1.012831  0.314247 -0.908024 -1.412304

### Set new index

In [36]:
new_col = 'MON TUE WED THUR FRI'.split()

In [37]:
df['Working Days'] = new_col

In [38]:
df

          V         W         X         Y Working Days
A  0.496714 -0.138264  0.647689  1.523030          MON
B -0.234153 -0.234137  1.579213  0.767435          TUE
C -0.469474  0.542560 -0.463418 -0.465730          WED
D  0.241962 -1.913280 -1.724918 -0.562288         THUR
E -1.012831  0.314247 -0.908024 -1.412304          FRI

In [39]:
df.set_index('Working Days')

                     V         W         X         Y
Working Days
MON           0.496714 -0.138264  0.647689  1.523030
TUE          -0.234153 -0.234137  1.579213  0.767435
WED          -0.469474  0.542560 -0.463418 -0.465730
THUR          0.241962 -1.913280 -1.724918 -0.562288
FRI          -1.012831  0.314247 -0.908024 -1.412304

In [40]:
df

          V         W         X         Y Working Days
A  0.496714 -0.138264  0.647689  1.523030          MON
B -0.234153 -0.234137  1.579213  0.767435          TUE
C -0.469474  0.542560 -0.463418 -0.465730          WED
D  0.241962 -1.913280 -1.724918 -0.562288         THUR
E -1.012831  0.314247 -0.908024 -1.412304          FRI

Since set_index() is not inplace by default, we need to explicitly mention **inplace=True**.

In [41]:
df.set_index('Working Days',inplace=True)

In [42]:
df

                     V         W         X         Y
Working Days
MON           0.496714 -0.138264  0.647689  1.523030
TUE          -0.234153 -0.234137  1.579213  0.767435
WED          -0.469474  0.542560 -0.463418 -0.465730
THUR          0.241962 -1.913280 -1.724918 -0.562288
FRI          -1.012831  0.314247 -0.908024 -1.412304

## Multi-Index and Index Hierarchy

In [43]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [44]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [45]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [46]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  1.465649 -0.225776
   2  0.067528 -1.424748
   3 -0.544383  0.110923
G2 1 -1.150994  0.375698
   2 -0.600639 -0.291694
   3 -0.601707  1.852278

### Indexing

In [47]:
df.loc['G1']

          A         B
1  1.465649 -0.225776
2  0.067528 -1.424748
3 -0.544383  0.110923

Note this is a dataframe too.

In [48]:
type(df.loc['G1'])

pandas.core.frame.DataFrame

In [49]:
df.loc['G1'].loc[1]

A    1.465649
B   -0.225776
Name: 1, dtype: float64

Now column with ['G1', 'G2'] and [1, 2, 3] are note named by default. We can see that by using names attribute of index in the dataframe

In [50]:
df.index.names

FrozenList([None, None])

**Name the inner index and outer index**

In [51]:
df.index.names = ['Group','Num']

In [52]:
df

                  A         B
Group Num
G1    1    1.465649 -0.225776
      2    0.067528 -1.424748
      3   -0.544383  0.110923
G2    1   -1.150994  0.375698
      2   -0.600639 -0.291694
      3   -0.601707  1.852278

### Cross section

In [53]:
df.xs('G1')
# Same as df.loc['G']

            A         B
Num
1    1.465649 -0.225776
2    0.067528 -1.424748
3   -0.544383  0.110923

In [54]:
df.xs(['G1',1])

A    1.465649
B   -0.225776
Name: (G1, 1), dtype: float64

In [55]:
df.xs(1,level='Num')

              A         B
Group
G1     1.465649 -0.225776
G2    -1.150994  0.375698